#####################################################################################
# 掲示板系の処理でdbを任意の接続先へ変更可能にするため
# タイトルコードに従って, db名を変更させる
#####################################################################################
module Gwsub::Model::Systemname
  #*****************************************************************************
  #処理毎に記述が変わるので注意
  #画像添付やアップロードの共通処理に値を渡すとき、何の処理かを判別する
  def system_name
    return 'gwsub'
  end
  def item_home_path
    return "/#{self.system_name}/"
  end
  #*****************************************************************************
end